driver-tests/bpelse/assign/AssignJbi/test/echoDecimalDataType_Invoke/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ech="http://stc.com/echoDecimalDataType">
  <soapenv:Body>
    <ech:item>
      <ech:string>string</ech:string>
      <ech:normalizedString>normalizedString </ech:normalizedString>
      <ech:token>token</ech:token>
      <ech:base64Binary>ZQ==</ech:base64Binary>
      <ech:hexBinary>6765726F</ech:hexBinary>
      <ech:integer>100</ech:integer>
      <ech:positiveInteger>201</ech:positiveInteger>
      <ech:negativeInteger>-201</ech:negativeInteger>
      <ech:nonNegativeInteger>200</ech:nonNegativeInteger>
      <ech:nonPositiveInteger>-200</ech:nonPositiveInteger>
      <ech:long>10</ech:long>
      <ech:unsignedLong>11</ech:unsignedLong>
      <ech:int>3</ech:int>
      <ech:unsignedInt>7</ech:unsignedInt>
      <ech:short>1</ech:short>
      <ech:unsignedShort>5</ech:unsignedShort>
      <ech:byte>2</ech:byte>
      <ech:unsignedByte>6</ech:unsignedByte>
      <ech:decimal>1000.00</ech:decimal>
      <ech:float>1.5E2</ech:float>
      <ech:double>1.051732E7</ech:double>
      <ech:boolean>true</ech:boolean>
      <ech:duration>P1Y2M6DT14H25M13S</ech:duration>
      <ech:dateTime>2014-06-09T08:15:04-07:00</ech:dateTime>
      <ech:date>2008-11-15</ech:date>
      <ech:time>23:41:13</ech:time>
      <ech:gYear>2013-08:00</ech:gYear>
      <ech:gYearMonth>2016-01</ech:gYearMonth>
      <ech:gMonth>--01</ech:gMonth>
      <ech:gMonthDay>--10-27</ech:gMonthDay>
      <ech:gDay>---17</ech:gDay>
      <ech:Name>Name</ech:Name>
      <ech:QName>QName</ech:QName>
      <ech:NCName>NCName</ech:NCName>
      <ech:anyURI>http://www.my.com/ac/caelumque</ech:anyURI>
      <ech:language>language</ech:language>
      <ech:ID>ID</ech:ID>
      <ech:IDREF>IDREF</ech:IDREF>
      <ech:IDREFS>IDREFS</ech:IDREFS>
      <ech:ENTITY>ENTITY</ech:ENTITY>
      <ech:ENTITIES>ENTITIES</ech:ENTITIES>
      <ech:NOTATION>NOTATION</ech:NOTATION>
      <ech:NMTOKEN>NMTOKEN</ech:NMTOKEN>
      <ech:NMTOKENS>NMTOKENS</ech:NMTOKENS>
    </ech:item>
  </soapenv:Body>
</soapenv:Envelope>